var dataArr = [];
var dataString = '1<br>\
	闻香识女人<br>\
	导演:马丁·布莱斯特<br>\
	主演: 阿尔·帕西诺，克里斯·奥唐纳，加布里埃尔·安瓦尔\n<br>\
	剧情介绍：查理竭力阻止了中校的自杀行为，从此他们之间萌生如父子般的感情。影片最后弗兰克在学校礼堂激昂演说，挽救了查理的前途，讽刺了学校的伪善。二人在互相鼓舞中得到重生<br>\
	<br>\
	<br>\
	2<br>\
	傲慢与偏见<br>\
	导演：乔·怀特<br>\
	主演：凯拉·奈特利，马修·麦克费登，吉娜·马隆<br>\
	剧情介绍：该片讲述了19世纪初期英国的乡绅之女伊丽莎白·班内特五姐妹的爱情与择偶的故事。因为男主人公富家公子达西的傲慢，从而使女主人公伊丽莎白对其产生了偏见，险些错过心中的真爱。<br>\
	<br>\
	<br>\
	3<br>\
	速度与激情<br>\
	导演：罗伯·科恩<br>\
	主演：保罗·沃克（1973~2013），范·迪塞尔，道恩·强森<br>\
	剧情介绍：《速度与激情》（Fast & Furious）是欧美主导的以赛车为主题的系列电影。该系列第八部目前定档2017年4月14日上映。导演罗伯·科恩 约翰·辛格顿 林诣彬 詹姆斯·温，主演范·迪塞尔<br>\
	<br>\
	<br>\
	4<br>\
	教父<br>\
	导演：弗朗西斯·福特·科波拉<br>\
	主演：马龙·白兰度，阿尔·帕西诺<br>\
	剧情介绍：该片讲述了以维托·唐·科莱昂为首的黑帮家族的发展过程以及科莱昂的小儿子迈克如何接任父亲成为黑帮首领的故事。1973年这部电影获得了第45届奥斯卡奖最佳电影、最佳男主角、最佳改编剧本三项奖项<br>\
	<br>\
	<br>\
	5<br>\
	蝙蝠侠前传2：黑暗骑士<br>\
	导演： 克里斯托弗·诺兰<br>\
　　主演： 克里斯蒂安·贝尔 希斯·莱杰 艾伦·艾克哈特<br>\
	剧情介绍：故事从小丑带着手下抢了一家黑道的银行开始，手下们被小丑的伎俩玩弄，开始自相残杀。当晚假的蝙蝠侠试着阻碍黑道与稻草人之间的毒品交易。<br>\
	<br>\
	<br>\
	6<br>\
	纽约黑帮 Gangs of New York<br>\
	导演： 马丁·斯科塞斯<br>\
　　主演： 莱昂纳多·迪卡普里奥 丹尼尔·戴-刘易斯 卡梅隆·迪亚茨<br>\
	剧情介绍:这是一部关于爱尔兰及意大利黑帮如何在纽约落地生根并且争食地盘的故事，时间设定在1846到1863年间。阿姆斯特朗(莱昂纳多·迪卡普里奥)是爱尔兰移民的黑帮组织“死兔党”首领瓦龙之子<br>\
	<br>\
	<br>\
	7<br>\
	谍影重重<br>\
	导演：道格·里曼<br>\
	主演：马特·达蒙，克里斯·库柏<br>\
	剧情介绍：影片主要讲述了马特·达蒙饰演的患有极端记忆丧失的男主角杰森·伯恩，试图在逃避美国中央情报局追杀的同时发掘出自己的真实身份。<br>\
    <br>\
    <br>\
    8<br>\
    借刀杀人<br>\
    导演： 迈克尔·曼<br>\
　　主演： 汤姆·克鲁斯 杰米·福克斯 贾达·萍克·史密斯<br>\
	剧情介绍:麦克斯(杰米·福克斯 Jamie Foxx 饰)是洛杉矶一名喜剧编剧，然而因写好的剧本一直卖不出去，现在只能依靠开出租为生。夜幕低垂，麦克斯在机场接了一位注定要改变他人生的客人<br>\
	<br>\
	<br>\
	9<br>\
	战争之王<br>\
	导演： 安德鲁·尼科尔<br>\
　　主演： 尼古拉斯·凯奇 布丽姬·穆娜 伊桑·霍克<br>\
	剧情介绍：根据真实故事改编，一部关于战争、金钱和个人良知的动作大片。主人公自欺欺人地相信：军火和其他商品没有什么区别，而忽略了军火背后战争的原罪性，因而最终家破人亡，备受良心的折磨。其实内涵隐情。<br>\
	<br>\
	<br>\
	10<br>\
	水果硬糖<br>\
	导演： 大卫·斯雷德<br>\
　　主演： 帕特里克·威尔森 艾伦·佩姬 珍妮弗·霍尔<br>\
	剧情介绍：杰夫绝没有想到在他自己的家里会被人在饮料中下了麻醉药，醒来的时候，杰夫发现自己被绑在椅子上，还是在自己的屋子，眼前还是那个柔弱的女孩海莉。杰夫以为这是一个叛逆女孩的恶作剧<br>\
	<br>\
	<br>\
	11<br>\
	理发师陶德<br>\
	导演： 蒂姆·波顿<br>\
　　主演： 约翰尼·德普 海伦娜·伯翰·卡特 阿伦·瑞克曼<br>\
	剧情介绍：影片讲叙在伦敦舰队街，理发匠本杰明·贝克拥有美丽的妻子、可爱的女儿。而正当他沉浸在这美满的一切时，法官看上了本杰明的妻子露西。在法官特平和帮凶本福德执事的设计下本杰明含冤入狱。<br>\
	<br>\
	<br>\
	12<br>\
	帕那索斯博士的奇幻秀<br>\
	导演： 特瑞·吉列姆<br>\
　　主演： 希斯·莱杰 克里斯托弗·普卢默 莉莉·科尔<br>\
	剧情介绍：奇幻马戏团的帕那索斯博士在很早很早以前曾和魔鬼尼克打过一个赌，赢了魔鬼，并获得永生。许多个世纪过去了，帕那索斯博士爱上了一个女人，他为了能和她在一起又和魔鬼尼克做了一笔交易，用永生换取了青春，但魔鬼提出了一个条件<br>\
	<br>\
	<br>\
	13<br>\
	盗梦空间<br>\
	导演： 克里斯托弗·诺兰<br>\
　　主演： 莱昂纳多·迪卡普里奥 艾伦·佩姬 约瑟夫·高登-莱维特<br>\
	剧情介绍：多姆·科布(莱昂纳多·迪卡普里奥饰)是一个经验老道的窃贼。在人们精神最为脆弱的时候，他潜入别人梦中，窃取潜意识中有价值的信息和秘密。在他看来，人类思维所能产生的能量是不可限量的——人们靠思维就可以建造城市<br>\
    <br>\
    <br>\
    14<br>\
    简爱<br>\
	导演： 凯瑞·福永<br>\
　　主演： 米娅·华希科沃斯卡，迈克尔·法斯宾德<br>\
	剧情介绍:影片改编自英国女作家夏洛蒂·勃朗特的同名小说，讲述一位从小变成孤儿的英国女子在各种磨难中不断追求自由与尊严，坚持自我，最终获得幸福的故事。<br>\
    <br>\
    <br>\
    15<br>\
	冷却者<br>\
	导演： 韦恩·克莱默<br>\
　　主演： 威廉姆·H·梅西 亚历克·鲍德温 玛丽亚·贝罗<br>\
	剧情介绍:伯尼·鲁特兹(威廉姆·H·梅西饰)首先是个正儿八经的拉斯维加斯人，其次则可以定位为一个标准的倒霉鬼，或许这还不够准确，用倒霉鬼中的倒霉鬼似乎更为贴切。从一次失败的婚姻，到与其本应亲密无间而却偏偏格格不入的儿子，再到那只走失的宝贝猫咪，每一件伯尼所插手的事都会变得一塌糊涂';
(function(){
	var moviesArr = dataString.split(/\s*<br>\s*<br>\s*<br>\s*/);
	console.log(moviesArr);
	for(var i = 0;i < moviesArr.length;i++){
		var thisMov = {};
		var movieDataArr = moviesArr[i].split(/<br>/);
		thisMov['img'] = movieDataArr[0] + '.jpg';
		thisMov['title'] = movieDataArr[1];
		thisMov['textMov'] =  movieDataArr[2]  + movieDataArr[3] + movieDataArr[4];
		dataArr.push(thisMov);
	}
	console.log(dataArr);
})();